import 'package:notebook/models/note.dart';
import 'package:notebook/resources/image_assets.dart';

class NoteMock {
  NoteMock._();
  static const List<Note> notes = [
    Note(
      titleNote: "Рецепт пирога",
      textNote: "Вишня - 0,7-1 кг"
          "\nМасло сливочное - 90 г"
          "\nСахар - 120 г"
          "\nЯйцо - 2 шт."
          "\nСоль - 0,5 ч. л."
          "\nМука - 130 г"
          "\nРазрыхлитель - 1 ч. л."
          "\nСахар ванильный - 1 пакетик"
          "\nСахарная пудра (для украшения пирога) - 1 ст. л.",
      imageAssetPath: ImageAssets.pie,
    ),
    Note(
      titleNote: "О котах",
      textNote:
          "По мнению многих зоологов, среди млекопитающих органы чувств наиболее развиты у кошек. Хотя слух у них развит хуже, чем, например, у мышей, превосходные (по человеческим меркам) зрение, обоняние и слух в сочетании с тактильными и вкусовыми рецепторами делают кошек очень чувствительными животными.",
      imageAssetPath: ImageAssets.cat,
    ),
    Note(
      titleNote: "Вопросы к тесту",
      textNote:
          "1.Cложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Идейные соображения высшего порядка, а также укрепление и развитие структуры требуют определения и уточнения систем массового участия. \n\n2.Разнообразный и богатый опыт начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке дальнейших направлений развития. \n\n 3.Равным образом консультация с широким активом требуют от нас анализа новых предложений.",
      imageAssetPath: ImageAssets.pen,
    ),
    Note(
      titleNote: "Список дел на завтра",
      textNote:
          "1.Cложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Идейные соображения высшего порядка, а также укрепление и развитие структуры требуют определения и уточнения систем массового участия. \n\n2.Разнообразный и богатый опыт начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке дальнейших направлений развития. \n\n 3.Равным образом консультация с широким активом требуют от нас анализа новых предложений.",
      imageAssetPath: ImageAssets.pen,
    ),
    Note(
      titleNote: "Книги для прочтения",
      textNote:
          "1.Cложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Идейные соображения высшего порядка, а также укрепление и развитие структуры требуют определения и уточнения систем массового участия. \n\n2.Разнообразный и богатый опыт начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке дальнейших направлений развития. \n\n 3.Равным образом консультация с широким активом требуют от нас анализа новых предложений.",
      imageAssetPath: ImageAssets.pen,
    ),
    Note(
      titleNote: "Данные",
      textNote:
          "1.Cложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Идейные соображения высшего порядка, а также укрепление и развитие структуры требуют определения и уточнения систем массового участия. \n\n2.Разнообразный и богатый опыт начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке дальнейших направлений развития. \n\n 3.Равным образом консультация с широким активом требуют от нас анализа новых предложений.",
      imageAssetPath: ImageAssets.pen,
    ),
    Note(
      titleNote: "Песня",
      textNote:
          "1.Cложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового участия. Идейные соображения высшего порядка, а также укрепление и развитие структуры требуют определения и уточнения систем массового участия. \n\n2.Разнообразный и богатый опыт начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке дальнейших направлений развития. \n\n 3.Равным образом консультация с широким активом требуют от нас анализа новых предложений.",
      imageAssetPath: ImageAssets.pen,
    ),
  ];
}
